/* Теги xml-файлов */
function GetObjTagXml()
{
	var ObjOut = {
		"Заказ":"",			//KMD, KMD-1-0, KMD-1-1, KMD-1-2
		"Документ":"",		//KMD, KMD-1-0, KMD-1-1, KMD-1-2
		"Документы":"",		//KMD
		"Приоритет":"",		//KMD-1-0, KMD-1-1, KMD-1-2
		"Чертеж":"",		//KMD-1-0, KMD-1-1, KMD-1-2
		"Марка":"",			//KMD-1-0, KMD-1-1???, KMD-1-2
		"Позиция":"",		//KMD-1-0
		"Профиль":"",		//KMD-1-0
		"":""};
	return ObjOut;
}

/* Атрибуты верхнего колонтитула */
function GetObjAttrHead()
{
	var ObjOut = {
		"Номер":"",			//Заказ, Документ
		"Модель":"",		//Заказ
		"Объект":"",		//Заказ
		"Ответственный":"",	//Заказ
		"Раздел":"",		//Документ
		"Название":"",		//Документ
		"Дата":"",			//Документ
		"":""};
	return ObjOut;
}

/* Атрибуты проверки наличия */
function GetObjAttrFiles()
{
	var ObjOut = [
		"pdf",				//Чертеж, Позиция
		"xml",				//Марка
		"nc",				//Позиция
		"dxf",				//Позиция
/*		
		"csv",				//Чертеж
		"txt",				//Чертеж
*/		
		""];
	return ObjOut;
}

/* Атрибуты проверки количества */
function GetObjAttrCheckSum()
{
	var ObjOut = new Objay(
		"Количество",		//Марка, Позиция
		"Макроколичество",	//Марка, Позиция
		"Вес",				//Чертеж???, Марка, Позиция???
		"");
	return ObjOut;
}

/* Атрибуты проверки hash-сумм файлов */
function GetObjAttrHash()
{
	var ObjOut = [
		"hashpdf",			//Чертеж, Позиция
		"hashdxf",			//Позиция
		"hashnc",			//Позиция
		"hashxml",			//Марка
/*
		"hashcsv",			//Чертеж
		"hashxt",			//Чертеж
*/
		""];
	return ObjOut;
}

/* Атрибуты cравнения данных */
function GetObjAttrCompare()
{
	var ObjOut = {
		"Номер":"",			//Чертеж, Марка, Позиция, Профиль
		"Длина":"",			//Марка, Позиция
		"Ширина":"",		//Марка, Позиция
		"Высота":"",		//Марка
		"Вес":"",			//Чертеж???, Марка, Позиция
		"Материал":"",		//Профиль
		"Примечание":"",	//Чертеж, Марки, Позиция

		"hashpdf":"",		//Чертеж, Позиция
		"hashdxf":"",		//Позиция
		"hashnc":"",		//Позиция
		"hashxml":"",		//Марка
/*
		"hashcsv":"",		//Чертеж
		"hashxt":"",		//Чертеж
*/
		"":""};
	return ObjOut;
}



/* Атрибуты анализа данных */



/* Атрибуты вывода и обработки ошибок */
function GetObjAttrOut()
{
	var ObjOut = {
		"Номер":"",			//Чертеж, Марка, Позиция, Профиль
		"Название":"",		//Чертеж???, Марка, Позиция
		"Длина":"",			//Марка, Позиция
		"Ширина":"",		//Марка, Позиция
		"Высота":"",		//Марка
		"Количество":"",	//Марка, Позиция
		"Макроколичество":"",//Марка, Позиция
		"Вес":"",			//Чертеж???, Марка, Позиция
		"Примечание":"",	//Чертеж, Марка, Позиция

		"pdf":"",			//Чертеж, Позиция
		"xml":"",			//Марка
		"nc":"",			//Позиция
		"dxf":"",			//Позиция
/*
		"csv":"",			//Чертеж
		"txt":"",			//Чертеж
*/
		"hashpdf":"",		//Чертеж, Позиция
		"hashdxf":"",		//Позиция
		"hashnc":"",		//Позиция
		"hashxml":"",		//Марка
/*
		"hashcsv":"",		//Чертеж
		"hashxt":"",		//Чертеж
*/
		"":""};
	return ObjOut;
}

/* Заголовки таблицы */
function GetObjAttrHeadTable()
{
	var ObjOut = [
		"Номер",			//Марка, Позиция
		"Конструктив\n(Имя)",//Марка, Позиция
		"Профиль",			//Чертеж???, Позиция
		"Материал",			//Позиция
		"Длина,\nмм",		//Позиция
		"Ширина,\nмм",		//Позиция
		"Кол.",				//Марка, Позиция
		"Вес,\nкг",			//Марка, Позиция
		"Примечание",		//Чертеж, Марка, Позиция

		"PDF",				//Чертеж, Позиция
		"XML",				//Марка
		"DXF",				//Позиция
		"NC",				//Позиция
/*
		"csv",				//Чертеж
		"txt",				//Чертеж
*/
		""];
	return ObjOut;
}